MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46J53/mcu.h
// Register: PPSCON
#define PPSCON PPSCON
extern volatile unsigned char           PPSCON              __at(0xEBF);
#ifndef _LIB_BUILD
asm("PPSCON equ 0EBFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOLOCK                 :1;
    };
} PPSCONbits_t;
extern volatile PPSCONbits_t PPSCONbits __at(0xEBF);
// bitfield macros
#define _PPSCON_IOLOCK_POSN                                 0x0
#define _PPSCON_IOLOCK_POSITION                             0x0
#define _PPSCON_IOLOCK_SIZE                                 0x1
#define _PPSCON_IOLOCK_LENGTH                               0x1
#define _PPSCON_IOLOCK_MASK                                 0x1

// Register: RPOR0
#define RPOR0 RPOR0
extern volatile unsigned char           RPOR0               __at(0xEC0);
#ifndef _LIB_BUILD
asm("RPOR0 equ 0EC0h");
#endif

// Register: RPOR1
#define RPOR1 RPOR1
extern volatile unsigned char           RPOR1               __at(0xEC1);
#ifndef _LIB_BUILD
asm("RPOR1 equ 0EC1h");
#endif

// Register: RPOR2
#define RPOR2 RPOR2
extern volatile unsigned char           RPOR2               __at(0xEC2);
#ifndef _LIB_BUILD
asm("RPOR2 equ 0EC2h");
#endif

// Register: RPOR3
#define RPOR3 RPOR3
extern volatile unsigned char           RPOR3               __at(0xEC3);
#ifndef _LIB_BUILD
asm("RPOR3 equ 0EC3h");
#endif

// Register: RPOR4
#define RPOR4 RPOR4
extern volatile unsigned char           RPOR4               __at(0xEC4);
#ifndef _LIB_BUILD
asm("RPOR4 equ 0EC4h");
#endif

// Register: RPOR5
#define RPOR5 RPOR5
extern volatile unsigned char           RPOR5               __at(0xEC5);
#ifndef _LIB_BUILD
asm("RPOR5 equ 0EC5h");
#endif

// Register: RPOR6
#define RPOR6 RPOR6
extern volatile unsigned char           RPOR6               __at(0xEC6);
#ifndef _LIB_BUILD
asm("RPOR6 equ 0EC6h");
#endif

// Register: RPOR7
#define RPOR7 RPOR7
extern volatile unsigned char           RPOR7               __at(0xEC7);
#ifndef _LIB_BUILD
asm("RPOR7 equ 0EC7h");
#endif

// Register: RPOR8
#define RPOR8 RPOR8
extern volatile unsigned char           RPOR8               __at(0xEC8);
#ifndef _LIB_BUILD
asm("RPOR8 equ 0EC8h");
#endif

// Register: RPOR9
#define RPOR9 RPOR9
extern volatile unsigned char           RPOR9               __at(0xEC9);
#ifndef _LIB_BUILD
asm("RPOR9 equ 0EC9h");
#endif

// Register: RPOR10
#define RPOR10 RPOR10
extern volatile unsigned char           RPOR10              __at(0xECA);
#ifndef _LIB_BUILD
asm("RPOR10 equ 0ECAh");
#endif

// Register: RPOR11
#define RPOR11 RPOR11
extern volatile unsigned char           RPOR11              __at(0xECB);
#ifndef _LIB_BUILD
asm("RPOR11 equ 0ECBh");
#endif

// Register: RPOR12
#define RPOR12 RPOR12
extern volatile unsigned char           RPOR12              __at(0xECC);
#ifndef _LIB_BUILD
asm("RPOR12 equ 0ECCh");
#endif

// Register: RPOR13
#define RPOR13 RPOR13
extern volatile unsigned char           RPOR13              __at(0xECD);
#ifndef _LIB_BUILD
asm("RPOR13 equ 0ECDh");
#endif

// Register: RPOR17
#define RPOR17 RPOR17
extern volatile unsigned char           RPOR17              __at(0xED1);
#ifndef _LIB_BUILD
asm("RPOR17 equ 0ED1h");
#endif

// Register: RPOR18
#define RPOR18 RPOR18
extern volatile unsigned char           RPOR18              __at(0xED2);
#ifndef _LIB_BUILD
asm("RPOR18 equ 0ED2h");
#endif

// Register: RPOR19
#define RPOR19 RPOR19
extern volatile unsigned char           RPOR19              __at(0xED3);
#ifndef _LIB_BUILD
asm("RPOR19 equ 0ED3h");
#endif

// Register: RPOR20
#define RPOR20 RPOR20
extern volatile unsigned char           RPOR20              __at(0xED4);
#ifndef _LIB_BUILD
asm("RPOR20 equ 0ED4h");
#endif

// Register: RPOR21
#define RPOR21 RPOR21
extern volatile unsigned char           RPOR21              __at(0xED5);
#ifndef _LIB_BUILD
asm("RPOR21 equ 0ED5h");
#endif

// Register: RPOR22
#define RPOR22 RPOR22
extern volatile unsigned char           RPOR22              __at(0xED6);
#ifndef _LIB_BUILD
asm("RPOR22 equ 0ED6h");
#endif

// Register: RPOR23
#define RPOR23 RPOR23
extern volatile unsigned char           RPOR23              __at(0xED7);
#ifndef _LIB_BUILD
asm("RPOR23 equ 0ED7h");
#endif

// Register: RPOR24
#define RPOR24 RPOR24
extern volatile unsigned char           RPOR24              __at(0xED8);
#ifndef _LIB_BUILD
asm("RPOR24 equ 0ED8h");
#endif

// Register: RPINR1
#define RPINR1 RPINR1
extern volatile unsigned char           RPINR1              __at(0xEE1);
#ifndef _LIB_BUILD
asm("RPINR1 equ 0EE1h");
#endif

// Register: RPINR2
#define RPINR2 RPINR2
extern volatile unsigned char           RPINR2              __at(0xEE2);
#ifndef _LIB_BUILD
asm("RPINR2 equ 0EE2h");
#endif

// Register: RPINR3
#define RPINR3 RPINR3
extern volatile unsigned char           RPINR3              __at(0xEE3);
#ifndef _LIB_BUILD
asm("RPINR3 equ 0EE3h");
#endif

// Register: RPINR4
#define RPINR4 RPINR4
extern volatile unsigned char           RPINR4              __at(0xEE4);
#ifndef _LIB_BUILD
asm("RPINR4 equ 0EE4h");
#endif

// Register: RPINR6
#define RPINR6 RPINR6
extern volatile unsigned char           RPINR6              __at(0xEE6);
#ifndef _LIB_BUILD
asm("RPINR6 equ 0EE6h");
#endif

// Register: RPINR15
#define RPINR15 RPINR15
extern volatile unsigned char           RPINR15             __at(0xEE7);
#ifndef _LIB_BUILD
asm("RPINR15 equ 0EE7h");
#endif

// Register: RPINR7
#define RPINR7 RPINR7
extern volatile unsigned char           RPINR7              __at(0xEE8);
#ifndef _LIB_BUILD
asm("RPINR7 equ 0EE8h");
#endif

// Register: RPINR8
#define RPINR8 RPINR8
extern volatile unsigned char           RPINR8              __at(0xEE9);
#ifndef _LIB_BUILD
asm("RPINR8 equ 0EE9h");
#endif

// Register: RPINR9
#define RPINR9 RPINR9
extern volatile unsigned char           RPINR9              __at(0xEEA);
#ifndef _LIB_BUILD
asm("RPINR9 equ 0EEAh");
#endif

// Register: RPINR12
#define RPINR12 RPINR12
extern volatile unsigned char           RPINR12             __at(0xEF2);
#ifndef _LIB_BUILD
asm("RPINR12 equ 0EF2h");
#endif

// Register: RPINR13
#define RPINR13 RPINR13
extern volatile unsigned char           RPINR13             __at(0xEF3);
#ifndef _LIB_BUILD
asm("RPINR13 equ 0EF3h");
#endif

