MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46J53/mcu.h
extern volatile TMR5Lbits_t TMR5Lbits __at(0xF23);
// bitfield macros
#define _TMR5L_TMR5L_POSN                                   0x0
#define _TMR5L_TMR5L_POSITION                               0x0
#define _TMR5L_TMR5L_SIZE                                   0x8
#define _TMR5L_TMR5L_LENGTH                                 0x8
#define _TMR5L_TMR5L_MASK                                   0xFF

// Register: TMR5H
#define TMR5H TMR5H
extern volatile unsigned char           TMR5H               __at(0xF24);
#ifndef _LIB_BUILD
asm("TMR5H equ 0F24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR5H                  :8;
    };
} TMR5Hbits_t;
extern volatile TMR5Hbits_t TMR5Hbits __at(0xF24);
// bitfield macros
#define _TMR5H_TMR5H_POSN                                   0x0
#define _TMR5H_TMR5H_POSITION                               0x0
#define _TMR5H_TMR5H_SIZE                                   0x8
#define _TMR5H_TMR5H_LENGTH                                 0x8
#define _TMR5H_TMR5H_MASK                                   0xFF

// Register: CM3CON
#define CM3CON CM3CON
extern volatile unsigned char           CM3CON              __at(0xF25);
#ifndef _LIB_BUILD
asm("CM3CON equ 0F25h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCH                    :2;
        unsigned CREF                   :1;
        unsigned EVPOL                  :2;
        unsigned CPOL                   :1;
        unsigned COE                    :1;
        unsigned CON                    :1;
    };
    struct {
        unsigned CCH0                   :1;
        unsigned CCH1                   :1;
        unsigned                        :1;
        unsigned EVPOL0                 :1;
        unsigned EVPOL1                 :1;
    };
    struct {
        unsigned CCH03                  :1;
        unsigned CCH13                  :1;
        unsigned CREF3                  :1;
        unsigned EVPOL03                :1;
        unsigned EVPOL13                :1;
        unsigned CPOL3                  :1;
        unsigned COE3                   :1;
        unsigned CON3                   :1;
    };
} CM3CONbits_t;
extern volatile CM3CONbits_t CM3CONbits __at(0xF25);
// bitfield macros
#define _CM3CON_CCH_POSN                                    0x0
#define _CM3CON_CCH_POSITION                                0x0
#define _CM3CON_CCH_SIZE                                    0x2
#define _CM3CON_CCH_LENGTH                                  0x2
#define _CM3CON_CCH_MASK                                    0x3
#define _CM3CON_CREF_POSN                                   0x2
#define _CM3CON_CREF_POSITION                               0x2
#define _CM3CON_CREF_SIZE                                   0x1
#define _CM3CON_CREF_LENGTH                                 0x1
#define _CM3CON_CREF_MASK                                   0x4
#define _CM3CON_EVPOL_POSN                                  0x3
#define _CM3CON_EVPOL_POSITION                              0x3
#define _CM3CON_EVPOL_SIZE                                  0x2
#define _CM3CON_EVPOL_LENGTH                                0x2
#define _CM3CON_EVPOL_MASK                                  0x18
#define _CM3CON_CPOL_POSN                                   0x5
#define _CM3CON_CPOL_POSITION                               0x5
#define _CM3CON_CPOL_SIZE                                   0x1
#define _CM3CON_CPOL_LENGTH                                 0x1
#define _CM3CON_CPOL_MASK                                   0x20
#define _CM3CON_COE_POSN                                    0x6
#define _CM3CON_COE_POSITION                                0x6
#define _CM3CON_COE_SIZE                                    0x1
#define _CM3CON_COE_LENGTH                                  0x1
#define _CM3CON_COE_MASK                                    0x40
#define _CM3CON_CON_POSN                                    0x7
#define _CM3CON_CON_POSITION                                0x7
#define _CM3CON_CON_SIZE                                    0x1
#define _CM3CON_CON_LENGTH                                  0x1
#define _CM3CON_CON_MASK                                    0x80
#define _CM3CON_CCH0_POSN                                   0x0
#define _CM3CON_CCH0_POSITION                               0x0
#define _CM3CON_CCH0_SIZE                                   0x1
#define _CM3CON_CCH0_LENGTH                                 0x1
#define _CM3CON_CCH0_MASK                                   0x1
#define _CM3CON_CCH1_POSN                                   0x1
#define _CM3CON_CCH1_POSITION                               0x1
#define _CM3CON_CCH1_SIZE                                   0x1
#define _CM3CON_CCH1_LENGTH                                 0x1
#define _CM3CON_CCH1_MASK                                   0x2
#define _CM3CON_EVPOL0_POSN                                 0x3
#define _CM3CON_EVPOL0_POSITION                             0x3
#define _CM3CON_EVPOL0_SIZE                                 0x1
#define _CM3CON_EVPOL0_LENGTH                               0x1
#define _CM3CON_EVPOL0_MASK                                 0x8
#define _CM3CON_EVPOL1_POSN                                 0x4
#define _CM3CON_EVPOL1_POSITION                             0x4
#define _CM3CON_EVPOL1_SIZE                                 0x1
#define _CM3CON_EVPOL1_LENGTH                               0x1
#define _CM3CON_EVPOL1_MASK                                 0x10
#define _CM3CON_CCH03_POSN                                  0x0
#define _CM3CON_CCH03_POSITION                              0x0
#define _CM3CON_CCH03_SIZE                                  0x1
#define _CM3CON_CCH03_LENGTH                                0x1
#define _CM3CON_CCH03_MASK                                  0x1
#define _CM3CON_CCH13_POSN                                  0x1
#define _CM3CON_CCH13_POSITION                              0x1
#define _CM3CON_CCH13_SIZE                                  0x1
#define _CM3CON_CCH13_LENGTH                                0x1
#define _CM3CON_CCH13_MASK                                  0x2
#define _CM3CON_CREF3_POSN                                  0x2
#define _CM3CON_CREF3_POSITION                              0x2
#define _CM3CON_CREF3_SIZE                                  0x1
#define _CM3CON_CREF3_LENGTH                                0x1
#define _CM3CON_CREF3_MASK                                  0x4
#define _CM3CON_EVPOL03_POSN                                0x3
#define _CM3CON_EVPOL03_POSITION                            0x3
#define _CM3CON_EVPOL03_SIZE                                0x1
#define _CM3CON_EVPOL03_LENGTH                              0x1
#define _CM3CON_EVPOL03_MASK                                0x8
#define _CM3CON_EVPOL13_POSN                                0x4
#define _CM3CON_EVPOL13_POSITION                            0x4
#define _CM3CON_EVPOL13_SIZE                                0x1
#define _CM3CON_EVPOL13_LENGTH                              0x1
#define _CM3CON_EVPOL13_MASK                                0x10
#define _CM3CON_CPOL3_POSN                                  0x5
#define _CM3CON_CPOL3_POSITION                              0x5
#define _CM3CON_CPOL3_SIZE                                  0x1
#define _CM3CON_CPOL3_LENGTH                                0x1
#define _CM3CON_CPOL3_MASK                                  0x20
#define _CM3CON_COE3_POSN                                   0x6
#define _CM3CON_COE3_POSITION                               0x6
#define _CM3CON_COE3_SIZE                                   0x1
#define _CM3CON_COE3_LENGTH                                 0x1
#define _CM3CON_COE3_MASK                                   0x40
#define _CM3CON_CON3_POSN                                   0x7
#define _CM3CON_CON3_POSITION                               0x7
#define _CM3CON_CON3_SIZE                                   0x1
#define _CM3CON_CON3_LENGTH                                 0x1
#define _CM3CON_CON3_MASK                                   0x80

// Register: UEP0
#define UEP0 UEP0
extern volatile unsigned char           UEP0                __at(0xF26);
#ifndef _LIB_BUILD
asm("UEP0 equ 0F26h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EPSTALL                :1;
        unsigned EPINEN                 :1;
        unsigned EPOUTEN                :1;
        unsigned EPCONDIS               :1;
        unsigned EPHSHK                 :1;
    };
    struct {
        unsigned EP0STALL               :1;
        unsigned EP0INEN                :1;
        unsigned EP0OUTEN               :1;
        unsigned EP0CONDIS              :1;
        unsigned EP0HSHK                :1;
    };
    struct {
        unsigned EPSTALL0               :1;
        unsigned EPINEN0                :1;
        unsigned EPOUTEN0               :1;
        unsigned EPCONDIS0              :1;
        unsigned EPHSHK0                :1;
    };
} UEP0bits_t;
extern volatile UEP0bits_t UEP0bits __at(0xF26);
// bitfield macros
#define _UEP0_EPSTALL_POSN                                  0x0
#define _UEP0_EPSTALL_POSITION                              0x0
#define _UEP0_EPSTALL_SIZE                                  0x1
#define _UEP0_EPSTALL_LENGTH                                0x1
#define _UEP0_EPSTALL_MASK                                  0x1
#define _UEP0_EPINEN_POSN                                   0x1
#define _UEP0_EPINEN_POSITION                               0x1
#define _UEP0_EPINEN_SIZE                                   0x1
#define _UEP0_EPINEN_LENGTH                                 0x1
#define _UEP0_EPINEN_MASK                                   0x2
#define _UEP0_EPOUTEN_POSN                                  0x2
#define _UEP0_EPOUTEN_POSITION                              0x2
#define _UEP0_EPOUTEN_SIZE                                  0x1
#define _UEP0_EPOUTEN_LENGTH                                0x1
#define _UEP0_EPOUTEN_MASK                                  0x4
#define _UEP0_EPCONDIS_POSN                                 0x3
#define _UEP0_EPCONDIS_POSITION                             0x3
#define _UEP0_EPCONDIS_SIZE                                 0x1
#define _UEP0_EPCONDIS_LENGTH                               0x1
#define _UEP0_EPCONDIS_MASK                                 0x8
#define _UEP0_EPHSHK_POSN                                   0x4
#define _UEP0_EPHSHK_POSITION                               0x4
#define _UEP0_EPHSHK_SIZE                                   0x1
#define _UEP0_EPHSHK_LENGTH                                 0x1
#define _UEP0_EPHSHK_MASK                                   0x10
#define _UEP0_EP0STALL_POSN                                 0x0
#define _UEP0_EP0STALL_POSITION                             0x0
#define _UEP0_EP0STALL_SIZE                                 0x1
#define _UEP0_EP0STALL_LENGTH                               0x1
#define _UEP0_EP0STALL_MASK                                 0x1
#define _UEP0_EP0INEN_POSN                                  0x1
#define _UEP0_EP0INEN_POSITION                              0x1
#define _UEP0_EP0INEN_SIZE                                  0x1
#define _UEP0_EP0INEN_LENGTH                                0x1
#define _UEP0_EP0INEN_MASK                                  0x2
#define _UEP0_EP0OUTEN_POSN                                 0x2
#define _UEP0_EP0OUTEN_POSITION                             0x2
#define _UEP0_EP0OUTEN_SIZE                                 0x1
#define _UEP0_EP0OUTEN_LENGTH                               0x1
#define _UEP0_EP0OUTEN_MASK                                 0x4
#define _UEP0_EP0CONDIS_POSN                                0x3
#define _UEP0_EP0CONDIS_POSITION                            0x3
#define _UEP0_EP0CONDIS_SIZE                                0x1
#define _UEP0_EP0CONDIS_LENGTH                              0x1
#define _UEP0_EP0CONDIS_MASK                                0x8
#define _UEP0_EP0HSHK_POSN                                  0x4
#define _UEP0_EP0HSHK_POSITION                              0x4
#define _UEP0_EP0HSHK_SIZE                                  0x1
#define _UEP0_EP0HSHK_LENGTH                                0x1
#define _UEP0_EP0HSHK_MASK                                  0x10
#define _UEP0_EPSTALL0_POSN                                 0x0
#define _UEP0_EPSTALL0_POSITION                             0x0
#define _UEP0_EPSTALL0_SIZE                                 0x1
#define _UEP0_EPSTALL0_LENGTH                               0x1
#define _UEP0_EPSTALL0_MASK                                 0x1
#define _UEP0_EPINEN0_POSN                                  0x1
#define _UEP0_EPINEN0_POSITION                              0x1
#define _UEP0_EPINEN0_SIZE                                  0x1
#define _UEP0_EPINEN0_LENGTH                                0x1
#define _UEP0_EPINEN0_MASK                                  0x2
#define _UEP0_EPOUTEN0_POSN                                 0x2
#define _UEP0_EPOUTEN0_POSITION                             0x2
#define _UEP0_EPOUTEN0_SIZE                                 0x1
#define _UEP0_EPOUTEN0_LENGTH                               0x1
#define _UEP0_EPOUTEN0_MASK                                 0x4
#define _UEP0_EPCONDIS0_POSN                                0x3
#define _UEP0_EPCONDIS0_POSITION                            0x3
#define _UEP0_EPCONDIS0_SIZE                                0x1
#define _UEP0_EPCONDIS0_LENGTH                              0x1
#define _UEP0_EPCONDIS0_MASK                                0x8
#define _UEP0_EPHSHK0_POSN                                  0x4
#define _UEP0_EPHSHK0_POSITION                              0x4
#define _UEP0_EPHSHK0_SIZE                                  0x1
#define _UEP0_EPHSHK0_LENGTH                                0x1
#define _UEP0_EPHSHK0_MASK                                  0x10

// Register: UEP1
#define UEP1 UEP1
extern volatile unsigned char           UEP1                __at(0xF27);
#ifndef _LIB_BUILD
asm("UEP1 equ 0F27h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EPSTALL                :1;
        unsigned EPINEN                 :1;
        unsigned EPOUTEN                :1;
        unsigned EPCONDIS               :1;
        unsigned EPHSHK                 :1;
    };
    struct {
        unsigned EP1STALL               :1;
        unsigned EP1INEN                :1;
        unsigned EP1OUTEN               :1;
        unsigned EP1CONDIS              :1;
        unsigned EP1HSHK                :1;
    };
    struct {
        unsigned EPSTALL1               :1;
        unsigned EPINEN1                :1;
        unsigned EPOUTEN1               :1;
        unsigned EPCONDIS1              :1;
        unsigned EPHSHK1                :1;
    };
} UEP1bits_t;
