MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46J53/mcu.h
extern volatile ODCON2bits_t ODCON2bits __at(0xF41);
// bitfield macros
#define _ODCON2_U1OD_POSN                                   0x0
#define _ODCON2_U1OD_POSITION                               0x0
#define _ODCON2_U1OD_SIZE                                   0x1
#define _ODCON2_U1OD_LENGTH                                 0x1
#define _ODCON2_U1OD_MASK                                   0x1
#define _ODCON2_U2OD_POSN                                   0x1
#define _ODCON2_U2OD_POSITION                               0x1
#define _ODCON2_U2OD_SIZE                                   0x1
#define _ODCON2_U2OD_LENGTH                                 0x1
#define _ODCON2_U2OD_MASK                                   0x2
#define _ODCON2_CCP9OD_POSN                                 0x2
#define _ODCON2_CCP9OD_POSITION                             0x2
#define _ODCON2_CCP9OD_SIZE                                 0x1
#define _ODCON2_CCP9OD_LENGTH                               0x1
#define _ODCON2_CCP9OD_MASK                                 0x4
#define _ODCON2_CCP10OD_POSN                                0x3
#define _ODCON2_CCP10OD_POSITION                            0x3
#define _ODCON2_CCP10OD_SIZE                                0x1
#define _ODCON2_CCP10OD_LENGTH                              0x1
#define _ODCON2_CCP10OD_MASK                                0x8

// Register: ODCON1
#define ODCON1 ODCON1
extern volatile unsigned char           ODCON1              __at(0xF42);
#ifndef _LIB_BUILD
asm("ODCON1 equ 0F42h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ECCP1OD                :1;
        unsigned ECCP2OD                :1;
        unsigned ECCP3OD                :1;
        unsigned CCP4OD                 :1;
        unsigned CCP5OD                 :1;
        unsigned CCP6OD                 :1;
        unsigned CCP7OD                 :1;
        unsigned CCP8OD                 :1;
    };
} ODCON1bits_t;
extern volatile ODCON1bits_t ODCON1bits __at(0xF42);
// bitfield macros
#define _ODCON1_ECCP1OD_POSN                                0x0
#define _ODCON1_ECCP1OD_POSITION                            0x0
#define _ODCON1_ECCP1OD_SIZE                                0x1
#define _ODCON1_ECCP1OD_LENGTH                              0x1
#define _ODCON1_ECCP1OD_MASK                                0x1
#define _ODCON1_ECCP2OD_POSN                                0x1
#define _ODCON1_ECCP2OD_POSITION                            0x1
#define _ODCON1_ECCP2OD_SIZE                                0x1
#define _ODCON1_ECCP2OD_LENGTH                              0x1
#define _ODCON1_ECCP2OD_MASK                                0x2
#define _ODCON1_ECCP3OD_POSN                                0x2
#define _ODCON1_ECCP3OD_POSITION                            0x2
#define _ODCON1_ECCP3OD_SIZE                                0x1
#define _ODCON1_ECCP3OD_LENGTH                              0x1
#define _ODCON1_ECCP3OD_MASK                                0x4
#define _ODCON1_CCP4OD_POSN                                 0x3
#define _ODCON1_CCP4OD_POSITION                             0x3
#define _ODCON1_CCP4OD_SIZE                                 0x1
#define _ODCON1_CCP4OD_LENGTH                               0x1
#define _ODCON1_CCP4OD_MASK                                 0x8
#define _ODCON1_CCP5OD_POSN                                 0x4
#define _ODCON1_CCP5OD_POSITION                             0x4
#define _ODCON1_CCP5OD_SIZE                                 0x1
#define _ODCON1_CCP5OD_LENGTH                               0x1
#define _ODCON1_CCP5OD_MASK                                 0x10
#define _ODCON1_CCP6OD_POSN                                 0x5
#define _ODCON1_CCP6OD_POSITION                             0x5
#define _ODCON1_CCP6OD_SIZE                                 0x1
#define _ODCON1_CCP6OD_LENGTH                               0x1
#define _ODCON1_CCP6OD_MASK                                 0x20
#define _ODCON1_CCP7OD_POSN                                 0x6
#define _ODCON1_CCP7OD_POSITION                             0x6
#define _ODCON1_CCP7OD_SIZE                                 0x1
#define _ODCON1_CCP7OD_LENGTH                               0x1
#define _ODCON1_CCP7OD_MASK                                 0x40
#define _ODCON1_CCP8OD_POSN                                 0x7
#define _ODCON1_CCP8OD_POSITION                             0x7
#define _ODCON1_CCP8OD_SIZE                                 0x1
#define _ODCON1_CCP8OD_LENGTH                               0x1
#define _ODCON1_CCP8OD_MASK                                 0x80

// Register: ALRMVALL
#define ALRMVALL ALRMVALL
extern volatile unsigned char           ALRMVALL            __at(0xF44);
#ifndef _LIB_BUILD
asm("ALRMVALL equ 0F44h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ALRMVALL               :8;
    };
} ALRMVALLbits_t;
extern volatile ALRMVALLbits_t ALRMVALLbits __at(0xF44);
// bitfield macros
#define _ALRMVALL_ALRMVALL_POSN                             0x0
#define _ALRMVALL_ALRMVALL_POSITION                         0x0
#define _ALRMVALL_ALRMVALL_SIZE                             0x8
#define _ALRMVALL_ALRMVALL_LENGTH                           0x8
#define _ALRMVALL_ALRMVALL_MASK                             0xFF

// Register: ALRMVALH
#define ALRMVALH ALRMVALH
extern volatile unsigned char           ALRMVALH            __at(0xF45);
#ifndef _LIB_BUILD
asm("ALRMVALH equ 0F45h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ALRMVALH               :8;
    };
} ALRMVALHbits_t;
extern volatile ALRMVALHbits_t ALRMVALHbits __at(0xF45);
// bitfield macros
#define _ALRMVALH_ALRMVALH_POSN                             0x0
#define _ALRMVALH_ALRMVALH_POSITION                         0x0
#define _ALRMVALH_ALRMVALH_SIZE                             0x8
#define _ALRMVALH_ALRMVALH_LENGTH                           0x8
#define _ALRMVALH_ALRMVALH_MASK                             0xFF

// Register: ALRMRPT
#define ALRMRPT ALRMRPT
extern volatile unsigned char           ALRMRPT             __at(0xF46);
#ifndef _LIB_BUILD
asm("ALRMRPT equ 0F46h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ARPT                   :8;
    };
    struct {
        unsigned ARPT0                  :1;
        unsigned ARPT1                  :1;
        unsigned ARPT2                  :1;
        unsigned ARPT3                  :1;
        unsigned ARPT4                  :1;
        unsigned ARPT5                  :1;
        unsigned ARPT6                  :1;
        unsigned ARPT7                  :1;
    };
} ALRMRPTbits_t;
